#+TITLE: assignment-1

** alphanum, fraction, letter, digit, nonzero

   #+NAME: letter
   #+begin_src elisp :results verbatim
     (defconst letters (do ((u ?Z (1- u))
                            (l ?a (1+ l))
                            (U nil)
                            (L nil))
                           ((and (< u ?A) (> l ?z)) (append (nreverse L) U))
                         (push (string u) U)
                         (push (string l) L)))

     (reduce (lambda (a b) (concat a "|" b)) letters)
   #+end_src

   #+RESULTS: letter
   : "a|b|c|d|e|f|g|h|i|j|k|l|m|n|o|p|q|r|s|t|u|v|w|x|y|z|A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z"A

   #+NAME: digit
   #+begin_src elisp :results verbatim
     (defconst digits (loop for digit from ?0 to ?9
                            collect (string digit)))

     (reduce (lambda (a b) (concat a "|" b)) digits)
   #+end_src

   #+RESULTS: digit
   : "0|1|2|3|4|5|6|7|8|9"

   #+NAME: nonzero
   #+begin_src elisp :results verbatim
     (defconst nonzeros (loop for digit from ?1 to ?9
                            collect (string digit)))

     (reduce (lambda (a b) (concat a "|" b)) nonzeros)
   #+end_src

   #+RESULTS: nonzero
   : "1|2|3|4|5|6|7|8|9"

   #+NAME: fraction
   #+begin_src elisp :results verbatim :noweb yes
     (format ".(%s)*(%s)|.0"
             <<digit()>>
             <<nonzero()>>) ;; would be cool to have a macro which surrounds the result in parenthesis
   #+end_src

   #+RESULTS: fraction
   : ".(0|1|2|3|4|5|6|7|8|9)*(1|2|3|4|5|6|7|8|9)|.0"

   #+NAME: alphanum
   #+begin_src elisp :results verbatim :noweb yes
     (format "(%s)|(%s)|_"
             <<letter()>>
             <<digit()>>)
   #+end_src

** id, integer, float

   #+NAME: id
   #+begin_src elisp :results verbatim :noweb yes
     (format "(%s)(%s)*"
             <<letter()>>
             <<alphanum()>>)
   #+end_src

   #+RESULTS: id
   : "(a|b|c|d|e|f|g|h|i|j|k|l|m|n|o|p|q|r|s|t|u|v|w|x|y|z|A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z)((a|b|c|d|e|f|g|h|i|j|k|l|m|n|o|p|q|r|s|t|u|v|w|x|y|z|A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z)|(0|1|2|3|4|5|6|7|8|9)|_)*"

   #+NAME: integer
   #+begin_src elisp :results verbatim :noweb yes
     (format "(%s)(%s)*|0"
             <<nonzero()>>
             <<digit()>>)
   #+end_src

   #+RESULTS: integer
   : "(1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0"

   #+NAME: float
   #+begin_src elisp :results verbatim :noweb yes
     (format "(%s)(%s)(e(+|-)?(%s))?"
             <<integer()>>
             <<fraction()>>
             <<integer()>>) ;; WARNING: need to escape . and +
   #+end_src

   #+RESULTS: float
   : "((1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0)(.(0|1|2|3|4|5|6|7|8|9)*(1|2|3|4|5|6|7|8|9)|.0)(e(+|-)?((1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0))?"

** operators, punctuation and reserved words

   #+NAME: operators
   #+begin_src elisp :results verbatim
     (defconst operators '("==" "+" "|"
                           "<>" "-" "&"
                           "<"  "*" "!"
                           ">"  "/"
                           "<=" "="
                           ">="))

     (reduce (lambda (a b) (concat a "|" b)) operators) ;; WARNING: need to escape |
   #+end_src

   #+RESULTS: operators
   : "==|+|||<>|-|&|<|*|!|>|/|<=|=|>="

   #+NAME: punctuation
   #+begin_src elisp :results verbatim
     (defconst punctuation '("(" ";"
                             ")" ","
                             "{" "."
                             "}" ":"
                             "[" "::"
                             "]" "->"))

     (reduce (lambda (a b) (concat a "|" b)) punctuation)
   #+end_src

   #+RESULTS: punctuation
   : "(|;|)|,|{|.|}|:|[|::|]|->"

   #+NAME: reserved-words
   #+begin_src elisp :results verbatim
     (defconst reserved-words '("if"      "public"  "read"
                                "then"    "private" "write"
                                "else"    "func"    "return"
                                "integer" "var"     "self"
                                "float"   "struct"  "inherits"
                                "void"    "while"   "let"
                                "func"    "impl"))

       (reduce (lambda (a b) (concat a "|" b)) reserved-words)
   #+end_src

   #+RESULTS: reserved-words
   : "if|public|read|then|private|write|else|func|return|integer|var|self|float|struct|inherits|void|while|let|func|impl"

** comments

   #+NAME: comments
   #+begin_src elisp :results verbatim
     (defconst comments '("/*" "*/"
                           "//"))

     (reduce (lambda (a b) (concat a "|" b)) comments)
   #+end_src

   #+RESULTS: comments
   : "/*|*/|//"

** regular expression for language

   #+NAME: regular expression for language
   #+begin_src elisp :results verbatim :noweb yes
     (format "(%s)|(%s)|(%s)|(%s)|(%s)|(%s)"
             <<id()>>
             <<integer()>>
             <<float()>>
             <<operators()>>
             <<punctuation()>>
             <<reserved-words()>>) ;; WARNING: sub-components contains characters which requires escaping
   #+end_src

   #+RESULTS: regular expression for language
   : "((a|b|c|d|e|f|g|h|i|j|k|l|m|n|o|p|q|r|s|t|u|v|w|x|y|z|A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z)((a|b|c|d|e|f|g|h|i|j|k|l|m|n|o|p|q|r|s|t|u|v|w|x|y|z|A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z)|(0|1|2|3|4|5|6|7|8|9)|_)*)|((1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0)|(((1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0)(.(0|1|2|3|4|5|6|7|8|9)*(1|2|3|4|5|6|7|8|9)|.0)(e(+|-)?((1|2|3|4|5|6|7|8|9)(0|1|2|3|4|5|6|7|8|9)*|0))?)|(==|+|||<>|-|&|<|*|!|>|/|<=|=|>=)|((|;|)|,|{|.|}|:|[|::|]|->)|(if|public|read|then|private|write|else|func|return|integer|var|self|float|struct|inherits|void|while|let|func|impl)"

